import proxyService from '../common/proxyService';

let javaUri = '/oms/auth/saveOrUpdateAuthRole';

let roleIds = [
  '概况-概况',
  '我的服务-概况',
  '我的功能-概况',
  '功能服务-概况',
  '套餐服务-概况',
  '购买记录-概况',
  '服务手册-概况',
  '营销干货-概况',
  '操作手册-概况',
  '公众号营销-公众号营销',
  '基础功能-公众号营销',
  '公众号管理-公众号营销',
  '自定义菜单-公众号营销',
  '个性化菜单-公众号营销',
  '关键词回复-公众号营销',
  '被关注回复-公众号营销',
  '素材管理-公众号营销',
  '模板管理-公众号营销',
  '标签管理-公众号营销',
  '裂变获客-公众号营销',
  '渠道码-公众号营销',
  '裂变宝-公众号营销',
  '任务奖励-公众号营销',
  '排行榜-公众号营销',
  '精准群发-公众号营销',
  '群发宝-公众号营销',
  '互动群发-公众号营销',
  '高级群发-公众号营销',
  '标准群发-公众号营销',
  '智能营销-公众号营销',
  '自助客服-公众号营销',
  '自动化营销-公众号营销',
  '微信导流-公众号营销',
  '数据统计-公众号营销',
  '用户概况-公众号营销',
  '访问量统计-公众号营销',
  '配套功能-公众号营销',
  '投诉管理-公众号营销',
  'H5营销-H5营销',
  '活动营销-H5营销',
  '人人拼团-H5营销',
  '疯狂砍价-H5营销',
  '活码系统-H5营销',
  '智能表单-H5营销',
  'H5裂变-H5营销',
  '配套功能-H5营销',
  '订单管理-H5营销',
  '智能核销-H5营销',
  '任务奖励-H5营销',
  '排行榜-H5营销',
  '投诉管理-H5营销',
  '销售雷达-销售雷达',
  '企业文库-销售雷达',
  '文章库-销售雷达',
  '销售线索-销售雷达',
  '线索池-销售雷达',
  '雷达通知-销售雷达',
  'BOSS数据-销售雷达',
  '线索统计-销售雷达',
  '员工统计-销售雷达',
  '文章统计-销售雷达',
  '通用功能-销售雷达',
  '投诉管理-销售雷达',
  '客户管理-客户管理',
  '我的所属粉丝-客户管理',
  '全部粉丝-客户管理',
  '智能客服-智能客服',
  '智能客服-智能客服',
  '智能客服-智能客服',
  '会话设置-智能客服',
  '会话设置-智能客服',
  '分配规则-智能客服',
  '接待组设置-智能客服',
  '知识库-智能客服',
  '数据统计-智能客服',
  '会话统计-智能客服',
  '企业设置-企业设置',
  '协作管理-企业设置',
  '员工管理-企业设置',
  '坐席管理-企业设置',
  '商家管理-企业设置',
  '订单管理-企业设置',
  '商品管理-企业设置',
  '门店信息-企业设置',
  '收款配置-企业设置',
  '企业信息-企业设置',
];

function post(data) {
  if (!data.length) return;
  console.log(data.length);
  let order = data.length * 100;
  let first = data.shift().split('-');

  proxyService
    .postProxy(null, javaUri, {
      params: {
        authRoleOrder: order,
        busiType: 'XDS',
        groupName: first[1],
        isEnabled: 1,
        roleId: '',
        roleName: first[0],
        sessionId: 'E5e1gAMpsD8RieAi6diVwh2Sh3WA0wVi',
        subSystem: 'PC_WEB_ADMIN_2',
      },
    })
    .then(res => {
      console.log(res);
      post(data);
    });
}

post(roleIds);
